0.1.0/tutorials/heat-transfer/buoyant-simple/external_coupled_cavity/0/omega
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      omega;
}

dimensions      [0 0 -1 0 0 0 0];
internalField   uniform 0.12;

boundaryField
{
  frontAndBack
  {
    type            omegaWallFunction;
    value           uniform 0.12;
  }
  topAndBottom
  {
    type            omegaWallFunction;
    value           uniform 0.12;
  }
  hot
  {
    type            omegaWallFunction;
    value           uniform 0.12;
  }
  cold
  {
    type            omegaWallFunction;
    value           uniform 0.12;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
